someone42/hardware-bitcoin-wallet/pic32/usb_hid_stream.c
/** \file usb_hid_stream.c
  *
  * \brief USB HID class driver which transfers data as a stream.
  *
  * This file implements a device-side USB HID class driver which transfers
  * data in a manner similar to the Silicon Labs CP2110. In a nutshell,
  * a data stream is broken up into chunks of maximum size 63 bytes, and those
  * chunks are sent as a bunch of HID reports where the report ID is the
  * chunk size. This is an abuse of the HID specification, but things are
  * done this way to allow "driverless" operation on Windows systems.
  *
  * Here's a high-level overview of what's provided in this file. There is
  * an implementation of streamGetOneByte() and streamPutOneByte(), which
  * read from or write to FIFOs. The interface to USB happens mainly through
  * callbacks, because USB is fundamentally asynchronous from a device's point
  * of view. The nature of asynchronous I/O means that care must be taken to
  * only queue (i.e. schedule) transfers if the appropriate FIFO is empty
  * or full enough. Things are complicated by the fact that the host can
  * get and send reports through both the Interrupt endpoints and the control
  * endpoint.
  *
  * Some additional notes:
  * - Care must be taken to avoid race conditions, since many of the callbacks
  *   can occur in an interrupt context. The assumption is made that there
  *   is only one interrupt context (i.e. USB interrupts cannot interrupt
  *   USB interrupts).
  * - If the host decides to get/send reports through an Interrupt endpoint
  *   and the control endpoint simultaneously, the order of reports is
  *   undefined (so don't do that!).
  * - It is necessary to support the "Set Report" control request
  *   (see setReport()) because the hidraw driver on Linux kernels
  *   earlier than 2.6.35 use it, even if the device provides a perfectly
  *   working Interrupt OUT endpoint.
  *
  * All references to the "USB specification" refer to revision 2.0, obtained
  * from http://www.usb.org/developers/docs/usb_20_110512.zip (see usb_20.pdf)
  * on 26 March 2012. All references to the "HID specification" refer to
  * revision 1.1, obtained
  * from http://www.usb.org/developers/devclass_docs/HID1_11.pdf
  * on 25 November 2012.
  *
  * This file is licensed as described by the file LICENCE.
  */

#include <stdint.h>
#include "usb_hal.h"
#include "usb_callbacks.h"
#include "usb_defs.h"
#include "usb_standard_requests.h"
#include "../common.h"
#include "serial_fifo.h"
#include "pic32_system.h"

/** Only include the report descriptor when including the descriptors
  * in usb_descriptors.h. */
#define ONLY_INCLUDE_REPORT_DESCRIPTOR
#include "usb_descriptors.h"

/** The endpoint number for transmission (Interrupt IN). It's IN because
  * from the host's perspective, data is flowing into it. */
#define TRANSMIT_ENDPOINT_NUMBER	1
/** The endpoint number for reception (Interrupt OUT). It's OUT because
  * from the host's perspective, data is flowing out of it. */
#define RECEIVE_ENDPOINT_NUMBER		2

/** Size of transmit FIFO buffer, in number of bytes. There isn't much to be
  * gained from making this significantly larger.
  * \warning This must be a power of 2.
  */
#define TRANSMIT_FIFO_SIZE			64
/** Size of receive FIFO buffer, in number of bytes. There isn't much to be
  * gained from making this significantly larger.
  * \warning This must be a power of 2.
  * \warning This must be >= #RECEIVE_HEADROOM, to handle the (unlikely)
  *          cases where the host does simultaneous writes to the
  *          Interrupt OUT endpoint and control endpoint.
  */
#define RECEIVE_FIFO_SIZE			256

/** Minimum number of bytes which must be available (free) in the receive
  * FIFO before a receive will be queued. This is not just #MAX_PACKET_SIZE
  * because the host may do simultaneous writes to the Interrupt OUT endpoint
  * and control endpoint, in which case two packets will be received in
  * quick succession. */
#define RECEIVE_HEADROOM			(2 * MAX_PACKET_SIZE)

/** The transmit FIFO buffer. */
volatile CircularBuffer transmit_fifo;
/** The receive FIFO buffer. */
volatile CircularBuffer receive_fifo;

/** Storage for the transmit FIFO buffer. */
static volatile uint8_t transmit_fifo_storage[TRANSMIT_FIFO_SIZE];
/** Storage for the receive FIFO buffer. */
static volatile uint8_t receive_fifo_storage[RECEIVE_FIFO_SIZE];

/** Flag (non-zero = set, zero = clear) which when set, indicates that a
  * packet has been queued for transmission on the Interrupt IN endpoint. */
static volatile int interrupt_transmit_queued;
/** Flag (non-zero = set, zero = clear) which when set, indicates that a
  * packet has been queued for reception on the Interrupt OUT endpoint. */
static volatile int interrupt_receive_queued;

/** Persistent packet buffer for packets sent from the Interrupt IN endpoint
  * (see #TRANSMIT_ENDPOINT_NUMBER). */
static uint8_t interrupt_packet_buffer[MAX_PACKET_SIZE];
/** Persistent packet buffer for packets sent from the control endpoint. This
  * needs to be separate from #interrupt_packet_buffer because both the
  * Interrupt IN endpoint and control endpoint can be transmitting
  * simultaneously. */
static uint8_t get_report_packet_buffer[MAX_PACKET_SIZE];

/** Persistent endpoint state for the transmit endpoint (with endpoint
  * number #TRANSMIT_ENDPOINT_NUMBER. */
static EndpointState transmit_endpoint_state;
/** Persistent endpoint state for the receive endpoint (with endpoint
  * number #RECEIVE_ENDPOINT_NUMBER. */
static EndpointState receive_endpoint_state;

/** Transmit packet buffer to use when sending 0 length packets. It's probably
  * okay to use NULL, but it's safer to always point the transmit buffer at
  * something. */
static const uint8_t null_packet[4];

/** Previous configuration value passed to usbClassSetConfiguration(). This
  * is used to detect configuration changes. */
static uint8_t old_configuration_value;

/** Flag (non-zero = set, zero = clear) which, when set, indicates that
  * streamGetOneByte() should queue a receive for the control endpoint instead
  * of the Interrupt OUT endpoint. This is used to handle the "Set Report"
  * request. */
static volatile int do_control_receive_queue;
/** Flag (non-zero = set, zero = clear) which, when set, indicates that
  * the next control transfer Data stage will contain an output report. This
  * is used to handle the "Set Report" request. */
static volatile int expect_control_report;
/** Expected report ID of a report received through the control endpoint. This
  * is only valid when #expect_control_report is set. */
static uint8_t expected_control_report_id;

/** Flag (non-zero = set, zero = clear) which, when set, indicates that
  * streamPutOneByte() should redirect bytes into #get_report_packet_buffer,
  * where they will be transmitted through the control endpoint (instead of
  * the Interrupt IN endpoint). This is used to handle the "Get Report"
  * request. */
static volatile int do_build_transmit_report;
/** Desired size (as given in the "Get Report" request), in bytes, of the
  * report to send through the control endpoint. This includes the report ID
  * byte. This is only valid when #do_build_transmit_report is set. */
static uint32_t desired_transmit_report_length;
/** Current size, in bytes, of the report which will be sent through the
  * control endpoint. This includes the report ID byte. This is only valid
  * when #do_build_transmit_report is set. */
static uint32_t current_transmit_report_length;

