someone42/hardware-bitcoin-wallet/pic32/usb_hid_stream.c
/** Fill up transmit packet buffer with bytes obtained from the transmit
  * FIFO buffer, then queue the packet for transmission, if necessary.
  * \param is_irq Pass a non-zero value if calling this from an interrupt
  *               request handler, otherwise pass zero.
  */
static void fillTransmitPacketBufferAndTransmit(int is_irq)
{
	uint32_t count;
	uint32_t i;

	i = 1;
	while ((i < sizeof(interrupt_packet_buffer)) && !isCircularBufferEmpty(&transmit_fifo))
	{
		interrupt_packet_buffer[i] = circularBufferRead(&transmit_fifo, is_irq);
		i++;
	}
	count = i - 1;
	interrupt_packet_buffer[0] = (uint8_t)count;
	if (count > 0)
	{
		// Set transmit_queued before queueing transmit to avoid race
		// condition where packet is transmitted just after
		// usbQueueTransmitPacket() call.
		interrupt_transmit_queued = 1;
		usbQueueTransmitPacket(interrupt_packet_buffer, count + 1, TRANSMIT_ENDPOINT_NUMBER, 0);
	}
	else
	{
		interrupt_transmit_queued = 0;
	}
}

/** Transfer bytes from a receive buffer into receive FIFO.
  * \warning This assumes there is enough space (if not, usbFatalError() will
  *          be called). There should always be enough space, since a receive
  *          is never queued unless there is enough space.
  */
static void transferIntoReceiveFIFO(uint8_t *buffer, uint32_t length)
{
	uint32_t i;

	if (circularBufferSpaceRemaining(&receive_fifo) < length)
	{
		// This should never happen.
		usbFatalError();
	}
	for (i = 0; i < length; i++)
	{
		circularBufferWrite(&receive_fifo, buffer[i], 1);
	}
}

/** Incrementally build a report to send via. the control endpoint. This is
  * used to handle the "Get Report" request. If the added byte completes
  * the report, it will be transmitted; #do_build_transmit_report will be
  * cleared if that happens.
  * \param one_byte The byte to add to the report.
  */
static void buildTransmitReport(uint8_t one_byte)
{
	if ((current_transmit_report_length >= desired_transmit_report_length)
		|| (current_transmit_report_length >= sizeof(get_report_packet_buffer))
		|| (do_build_transmit_report == 0))
	{
		// This should never happen.
		usbFatalError();
	}
	get_report_packet_buffer[current_transmit_report_length] = one_byte;
	current_transmit_report_length++;
	if (current_transmit_report_length == desired_transmit_report_length)
	{
		// Got desired size, send it.
		usbQueueTransmitPacket(get_report_packet_buffer, desired_transmit_report_length, CONTROL_ENDPOINT, 0);
		do_build_transmit_report = 0;
	}
}

/** Callback which is called whenever a packet is received on the Interrupt
  * IN endpoint (endpoint number #TRANSMIT_ENDPOINT_NUMBER).
  * \param packet_buffer The contents of the packet.
  * \param length The length (in bytes) of the received packet.
  * \param is_setup Will be non-zero if a SETUP token was received, will
  *                 be zero if a OUT or IN token was received.
  */
void ep1ReceiveCallback(uint8_t *packet_buffer, uint32_t length, unsigned int is_setup)
{
	// Since this is an IN endpoint, this callback should never be called.
	usbFatalError();
}

/** Callback which is called whenever a packet is transmitted on the Interrupt
  * IN endpoint (endpoint number #TRANSMIT_ENDPOINT_NUMBER). */
void ep1TransmitCallback(void)
{
	fillTransmitPacketBufferAndTransmit(1);
}

/** Callback which is called whenever a packet is received on the Interrupt
  * OUT endpoint (endpoint number #RECEIVE_ENDPOINT_NUMBER).
  * \param packet_buffer The contents of the packet.
  * \param length The length (in bytes) of the received packet.
  * \param is_setup Will be non-zero if a SETUP token was received, will
  *                 be zero if a OUT or IN token was received.
  * \warning This assumes that there is enough space in the receive FIFO for
  *          the received packet. There should always be enough space, since
  *          a receive is never queued unless there is enough space.
  */
void ep2ReceiveCallback(uint8_t *packet_buffer, uint32_t length, unsigned int is_setup)
{
	// Check that the packet length (provided by the USB module) matches
	// the length given in the first byte.
	if (length < 1)
	{
		// Packet too small.
		usbFatalError();
	}
	else if (packet_buffer[0] != (length - 1))
	{
		usbFatalError();
	}
	else
	{
		transferIntoReceiveFIFO(&(packet_buffer[1]), length - 1);
		// What happens if there isn't enough space in the receive buffer?
		// Then a receive isn't queued up. This will cause subsequent OUT
		// transactions to be NAKed, blocking the host. Each
		// streamGetOneByte() call frees up space in the receive FIFO,
		// until eventually there is enough space to queue a receive.
		if (circularBufferSpaceRemaining(&receive_fifo) >= RECEIVE_HEADROOM)
		{
			interrupt_receive_queued = 1;
			usbQueueReceivePacket(RECEIVE_ENDPOINT_NUMBER);
		}
		else
		{
			interrupt_receive_queued = 0;
		}
	}
}

/** Callback which is called whenever a packet is transmitted on the Interrupt
  * OUT endpoint (endpoint number #RECEIVE_ENDPOINT_NUMBER). */
void ep2TransmitCallback(void)
{
	// Since this is the OUT endpoint, this callback should never be called.
	usbFatalError();
}

/** HID class-specific "Get Descriptor" request, as defined in section 7.1.1
  * of the HID specification. This allows the host to retrieve HID
  * class-specific information about a USB device.
  * \param type Descriptor type. Should be one of #DescriptorTypes.
  * \param index Descriptor index, used to select a specific descriptor.
  * \param lang_id Language identifier, only used for string descriptors (must
  *                be zero for everything else).
  * \param request_length Maximum number of bytes of descriptor to send.
  */
static void getDescriptor(uint8_t type, uint8_t index, uint16_t lang_id, uint16_t request_length)
{
	uint32_t packet_length;

	if ((type == DESCRIPTOR_REPORT) && (index == 0) && (lang_id == 0))
	{
		packet_length = MIN(sizeof(report_descriptor), request_length);
		usbControlNextStage();
		if (packet_length == 0)
		{
			usbControlProtocolStall();
		}
		else
		{
			usbQueueTransmitPacket(report_descriptor, packet_length, CONTROL_ENDPOINT_NUMBER, 1);
		}
	}
	else
	{
		// Unknown or invalid descriptor specified.
		usbControlProtocolStall();
	}
}

/** HID class-specific "Get Report" request, as defined in section 7.2.1
  * of the HID specification. This is an alternative way for the host to
  * receive reports from a device, as opposed to the usual method of polling
  * the Interrupt IN endpoint.
  * \param report_id Report ID of the desired report. For this driver, this
  *                  means the number of data bytes in the report.
  * \param length Length, in bytes, of the report.
  */
static void getReport(uint8_t report_id, uint16_t length)
{
	usbControlNextStage();
	if ((length < 1) || (length > MAX_PACKET_SIZE))
	{
		// Bad length.
		// Reports must have at least one byte for the report ID. Reports
		// must also be able to fit in one packet.
		usbControlProtocolStall();
	}
	else if (report_id != (length - 1))
	{
		// Report ID does not match request length.
		usbControlProtocolStall();
	}
	else
	{
		// Build a report and send it.
		do_build_transmit_report = 1;
		current_transmit_report_length = 0;
		desired_transmit_report_length = length;
		buildTransmitReport(report_id);
		// Two ways this loop can end:
		// 1. The report length reaches the desired length, in which case the
		//    report is sent and do_build_transmit_report is set to 0.
		// 2. The transmit FIFO is emptied before the report reaches the
		//    desired size, so nothing is sent and do_build_transmit_report
		//    remains set. streamPutOneByte() will handle the rest.
		while (!isCircularBufferEmpty(&transmit_fifo) && do_build_transmit_report)
		{
			buildTransmitReport(circularBufferRead(&transmit_fifo, 1));
		}
	}
}

/** HID class-specific "Set Report" request, as defined in section 7.2.2
  * of the HID specification. This is an alternative way for the host to
  * send reports to a device, as opposed to the usual method writing to
  * the Interrupt OUT endpoint.
  * \param report_id Report ID of the report to send. For this driver, this
  *                  means the number of data bytes in the report.
  * \param length Length, in bytes, of the report.
  */
static void setReport(uint8_t report_id, uint16_t length)
{
	if ((length < 1) || (length > MAX_PACKET_SIZE))
	{
		// Bad length.
		// Reports must have at least one byte for the report ID. Reports
		// must also be able to fit in one packet.
		usbControlProtocolStall();
	}
	else if (report_id != (length - 1))
	{
		// Report ID does not match request length.
		usbControlProtocolStall();
	}
	else
	{
		usbControlNextStage();
		expected_control_report_id = report_id;
		expect_control_report = 1;
		if (circularBufferSpaceRemaining(&receive_fifo) < RECEIVE_HEADROOM)
		{
			// Not enough space in receive FIFO to handle request.
			usbSuppressControlReceive(); // do not immediately proceed to Data stage
			// Redirect streamGetOneByte() to queue receives on the control
			// endpoint instead of the Interrupt OUT endpoint.
			do_control_receive_queue = 1;
		}
	}
}

/** All standard requests (as described in chapter 9 of the USB specification)
  * are issued to the control endpoint (endpoint 0). However, sometimes
  * class-specific requests are sent to the control endpoint. This callback
  * gives class drivers the opportunity to handle those class-specific
  * requests.
  * Class drivers should examine the control transfer setup parameters and
  * perform an appropriate action if the parameters match a supported
  * class-specific request.
  * \param bmRequestType Characteristics of request.
  * \param bRequest Specifies which request to perform.
  * \param wValue Request-dependent parameter.
  * \param wIndex Request-dependent parameter.
  * \param wLength Maximum number of bytes to transfer during the Data stage.
  *                This is allowed to be zero. If it is zero, then there is
  *                no Data stage.
  * \return Zero if the request was handled, non-zero if the request was not
  *         handled (i.e. the request did not match any supported
  *         class-specific request).
  */
unsigned int usbClassHandleControlSetup(uint8_t bmRequestType, uint8_t bRequest, uint16_t wValue, uint16_t wIndex, uint16_t wLength)
{
	if ((bmRequestType == 0x81) && (bRequest == GET_DESCRIPTOR))
	{
		getDescriptor((uint8_t)(wValue >> 8), (uint8_t)wValue, wIndex, wLength);
	}
	else if ((bmRequestType == 0xa1) && (bRequest == GET_REPORT)
			&& ((uint8_t)(wValue >> 8) == REPORT_TYPE_INPUT) && (wIndex == 0))
	{
		getReport((uint8_t)wValue, wLength);
	}
	else if ((bmRequestType == 0x21) && (bRequest == SET_REPORT)
			&& ((uint8_t)(wValue >> 8) == REPORT_TYPE_OUTPUT) && (wIndex == 0))
	{
		setReport((uint8_t)wValue, wLength);
	}
	else
	{
		return 1; // unknown or unsupported request.
	}
	return 0; // success
}

