someone42/hardware-bitcoin-wallet/pic32/usb_hid_stream.c
/** This callback will be called if the control endpoint (endpoint 0)
  * receives data during the Data stage of a class-specific request. This
  * callback gives class drivers the opportunity to handle data sent to the
  * control endpoint.
  * \param packet_buffer The contents of the data packet are placed here.
  * \param length The length (in bytes) of the received data packet.
  * \return Zero if the data was accepted, non-zero if the data was not
  *         handled (i.e. the class driver did not expect any data).
  */
unsigned int usbClassHandleControlData(uint8_t *packet_buffer, uint32_t length)
{
	if (expect_control_report)
	{
		// Check that the packet length (provided by the USB module) matches
		// the report ID.
		if (length >= 1)
		{
			if ((packet_buffer[0] != (length - 1))
				|| (expected_control_report_id != packet_buffer[0]))
			{
				// Report ID doesn't match request length.
				usbControlProtocolStall();
			}
			else
			{
				usbControlNextStage();
				transferIntoReceiveFIFO(&(packet_buffer[1]), length - 1);
				// Send success packet.
				usbQueueTransmitPacket(null_packet, 0, CONTROL_ENDPOINT_NUMBER, 0);
			}
		}
		else
		{
			// Packet too small.
			usbControlProtocolStall();
		}
		return 0;
	}
	else
	{
		return 1; // did not expect any data
	}
}

/** This will be called whenever a control transfer needs to be aborted (for
  * any reason, including reset). This allows class drivers to reset their
  * control transfer-specific state. */
void usbClassAbortControlTransfer(void)
{
	do_control_receive_queue = 0;
	expect_control_report = 0;
	do_build_transmit_report = 0;
}

/** Callback which will be called whenever a successful "Set Configuration"
  * request (see section 9.4.7 of the USB specification) is encountered. This
  * gives the class driver an opportunity to configure or unconfigure
  * endpoints, buffers, state etc.
  * \param new_configuration_value 0 means unconfigure device, 1 means
  *                                configure device.
  */
void usbClassSetConfiguration(uint8_t new_configuration_value)
{
	if ((old_configuration_value == 0) && (new_configuration_value != 0))
	{
		// Transition from unconfigured to configured.
		interrupt_transmit_queued = 0;
		interrupt_receive_queued = 1;
		usbEnableEndpoint(TRANSMIT_ENDPOINT_NUMBER, IN_ENDPOINT, &transmit_endpoint_state);
		usbEnableEndpoint(RECEIVE_ENDPOINT_NUMBER, OUT_ENDPOINT, &receive_endpoint_state);
	}
	else if ((old_configuration_value != 0) && (new_configuration_value == 0))
	{
		// Transition from configured to unconfigured.
		usbDisableEndpoint(TRANSMIT_ENDPOINT_NUMBER);
		usbDisableEndpoint(RECEIVE_ENDPOINT_NUMBER);
		interrupt_transmit_queued = 0;
		interrupt_receive_queued = 0;
		usbClassAbortControlTransfer(); // will reset state
	}
	old_configuration_value = new_configuration_value;
}

/** This will be called whenever a USB reset is seen. This callback gives
  * class drivers the opportunity to reset their state. */
void usbClassResetSeen(void)
{
	usbClassSetConfiguration(0);
}

/** Initialise HID stream driver. This must be called before connecting the
  * USB device (usbConnect()) or calling streamGetOneByte() and
  * streamPutOneByte(), otherwise race conditions with the FIFOs could
  * occur. */
void usbHIDStreamInit(void)
{
	old_configuration_value = 0;
	usbClassAbortControlTransfer(); // will reset state
	initCircularBuffer(&transmit_fifo, transmit_fifo_storage, TRANSMIT_FIFO_SIZE);
	initCircularBuffer(&receive_fifo, receive_fifo_storage, RECEIVE_FIFO_SIZE);
	transmit_endpoint_state.receiveCallback = &ep1ReceiveCallback;
	transmit_endpoint_state.transmitCallback = &ep1TransmitCallback;
	receive_endpoint_state.receiveCallback = &ep2ReceiveCallback;
	receive_endpoint_state.transmitCallback = &ep2TransmitCallback;
}

/** Grab one byte from the communication stream. There is no way for this
  * function to indicate a read error. This is intentional; it
  * makes program flow simpler (no need to put checks everywhere). As a
  * consequence, this function should only return if the received byte is
  * free of read errors.
  *
  * Previously, if a read or write error occurred, processPacket() would
  * return, an error message would be displayed and execution would halt.
  * There is no reason why this couldn't be done inside streamGetOneByte()
  * or streamPutOneByte(). So nothing was lost by omitting the ability to
  * indicate read or write errors.
  *
  * Perhaps the argument can be made that if this function indicated read
  * errors, the caller could attempt some sort of recovery. Perhaps
  * processPacket() could send something to request the retransmission of
  * a packet. But retransmission requests are something which can be dealt
  * with by the implementation of the stream. Thus a caller of
  * streamGetOneByte() will assume that the implementation handles things
  * like automatic repeat request, flow control and error detection and that
  * if a true "stream read error" occurs, the communication link is shot to
  * bits and nothing the caller can do will fix that.
  * \return The received byte.
  */
uint8_t streamGetOneByte(void)
{
	uint32_t status;
	uint8_t one_byte;

	one_byte = circularBufferRead(&receive_fifo, 0);
	// It's probably safe to leave interrupts enabled, but just to be sure,
	// disable them so that no race conditions can occur.
	status = disableInterrupts();
	// Control transfers take precedence over interrupt transfers, because
	// a control transfer will block all subsequent control transfers, which
	// would make device reconfiguration difficult.
	if (do_control_receive_queue)
	{
		if (circularBufferSpaceRemaining(&receive_fifo) >= RECEIVE_HEADROOM)
		{
			do_control_receive_queue = 0;
			usbQueueReceivePacket(CONTROL_ENDPOINT_NUMBER);
		}
	}
	else if (!interrupt_receive_queued)
	{
		if (circularBufferSpaceRemaining(&receive_fifo) >= RECEIVE_HEADROOM)
		{
			interrupt_receive_queued = 1;
			usbQueueReceivePacket(RECEIVE_ENDPOINT_NUMBER);
		}
	}
	restoreInterrupts(status);
	return one_byte;
}

/** Send one byte to the communication stream. There is no way for this
  * function to indicate a write error. This is intentional; it
  * makes program flow simpler (no need to put checks everywhere). As a
  * consequence, this function should only return if the byte was sent
  * free of write errors.
  *
  * See streamGetOneByte() for some justification about why write errors
  * aren't indicated by a return value.
  * \param one_byte The byte to send.
  */
void streamPutOneByte(uint8_t one_byte)
{
	if (do_build_transmit_report)
	{
		// Keep adding bytes to the transmit report until it reaches the
		// desired length.
		buildTransmitReport(one_byte);
	}
	else
	{
		// Since transmitted bytes are fed to this function one-at-a-time,
		// there's no way to determine whether there are bytes after this one
		// or not. So this function will just transmit the first byte in a
		// packet all by itself (which isn't very efficient). If there are
		// bytes immediately after this one, they will queue up in the transmit
		// FIFO, where they will be efficiently grouped into a packet by
		// ep1TransmitCallback().
		circularBufferWrite(&transmit_fifo, one_byte, 0);
	}
	// If a transmit interrupt occurs here, then it is possible that the byte
	// just pushed into the transmit FIFO is transmitted before the
	// call to fillTransmitPacketBufferAndTransmit(). In that case, the
	// call to fillTransmitPacketBufferAndTransmit() below will see that the
	// transmit FIFO is empty, and do nothing.
	if (!interrupt_transmit_queued)
	{
		// If transmit_queued is 0, then there is no chance for a race
		// condition since ep1TransmitCallback() should not be called when
		// transmit_queued is 0.
		fillTransmitPacketBufferAndTransmit(0);
	}
	// At this point: either the transmit FIFO is empty, or there is a
	// transmit queued (but not both).
}
